A couple questions, when I try this on a brand new app, I'm getting an error about the deployment ID not existing:

```
╷
│ Error: Error creating API Gateway Stage: BadRequestException: Deployment id does not exist
│
│   with aws_api_gateway_stage.rest_api,
│   on chalice.tf.json line 89, in resource.aws_api_gateway_stage.rest_api:
│   89:       }
│
```

For reference here's the:

<details>
<summary> app.py file </summary>

```
from chalice import Chalice

app = Chalice(app_name='tf3')


@app.route('/')
def index():
    return {'hello': 'world'}


@app.lambda_function()
def tf3asdf(event, context):
    return {'foo': 'bar'}
```

</details>

<details>
<summary> generated chalice.tf.json template </summary>

```
{
  "resource": {
    "aws_iam_role": {
      "default-role": {
        "name": "tf3-dev",
        "assume_role_policy": "{\"Version\": \"2012-10-17\", \"Statement\": [{\"Sid\": \"\", \"Effect\": \"Allow\", \"Principal\": {\"Service\": \"lambda.amazonaws.com\"}, \"Action\": \"sts:AssumeRole\"}]}"
      }
    },
    "aws_iam_role_policy": {
      "default-role": {
        "name": "default-rolePolicy",
        "policy": "{\"Version\": \"2012-10-17\", \"Statement\": [{\"Effect\": \"Allow\", \"Action\": [\"logs:CreateLogGroup\", \"logs:CreateLogStream\", \"logs:PutLogEvents\"], \"Resource\": \"arn:*:logs:*:*:*\"}]}",
        "role": "${aws_iam_role.default-role.id}"
      }
    },
    "aws_lambda_function": {
      "tf3asdf": {
        "function_name": "tf3-dev-tf3asdf",
        "runtime": "python3.9",
        "handler": "app.tf3asdf",
        "memory_size": 128,
        "tags": {
          "aws-chalice": "version=1.26.2:stage=dev:app=tf3"
        },
        "timeout": 60,
        "source_code_hash": "${filebase64sha256(\"${path.module}/deployment.zip\")}",
        "filename": "${path.module}/deployment.zip",
        "role": "${aws_iam_role.default-role.arn}"
      },
      "api_handler": {
        "function_name": "tf3-dev",
        "runtime": "python3.9",
        "handler": "app.app",
        "memory_size": 128,
        "tags": {
          "aws-chalice": "version=1.26.2:stage=dev:app=tf3"
        },
        "timeout": 60,
        "source_code_hash": "${filebase64sha256(\"${path.module}/deployment.zip\")}",
        "filename": "${path.module}/deployment.zip",
        "role": "${aws_iam_role.default-role.arn}"
      }
    },
    "aws_api_gateway_rest_api": {
      "rest_api": {
        "body": "${data.template_file.chalice_api_swagger.rendered}",
        "name": "tf3",
        "binary_media_types": [
          "application/octet-stream",
          "application/x-tar",
          "application/zip",
          "audio/basic",
          "audio/ogg",
          "audio/mp4",
          "audio/mpeg",
          "audio/wav",
          "audio/webm",
          "image/png",
          "image/jpg",
          "image/jpeg",
          "image/gif",
          "video/ogg",
          "video/mpeg",
          "video/webm"
        ],
        "endpoint_configuration": {
          "types": [
            "EDGE"
          ]
        }
      }
    },
    "aws_api_gateway_deployment": {
      "rest_api": {
        "rest_api_id": "${aws_api_gateway_rest_api.rest_api.id}",
        "triggers": {
          "redeployment": "sha1(jsonencode(aws_api_gateway_rest_api.rest_api.body))"
        },
        "lifecycle": {
          "create_before_destroy": true
        }
      }
    },
    "aws_api_gateway_stage": {
      "rest_api": {
        "deployment_id": "aws_api_gateway_deployment.rest_api.id",
        "rest_api_id": "${aws_api_gateway_rest_api.rest_api.id}",
        "stage_name": "api"
      }
    },
    "aws_lambda_permission": {
      "rest_api_invoke": {
        "function_name": "${aws_lambda_function.api_handler.arn}",
        "action": "lambda:InvokeFunction",
        "principal": "apigateway.amazonaws.com",
        "source_arn": "${aws_api_gateway_rest_api.rest_api.execution_arn}/*",
        "depends_on": [
          "aws_api_gateway_deployment.rest_api"
        ]
      }
    }
  },
  "terraform": {
    "required_version": "> 0.11.0, < 1.1.0"
  },
  "provider": {
    "template": {
      "version": "~> 2"
    },
    "aws": {
      "version": ">= 3.25, < 4"
    },
    "null": {
      "version": ">= 2, < 4"
    }
  },
  "data": {
    "aws_caller_identity": {
      "chalice": {}
    },
    "aws_partition": {
      "chalice": {}
    },
    "aws_region": {
      "chalice": {}
    },
    "null_data_source": {
      "chalice": {
        "inputs": {
          "app": "tf3",
          "stage": "dev"
        }
      }
    },
    "template_file": {
      "chalice_api_swagger": {
        "template": "{\"swagger\": \"2.0\", \"info\": {\"version\": \"1.0\", \"title\": \"tf3\"}, \"schemes\": [\"https\"], \"paths\": {\"/\": {\"get\": {\"consumes\": [\"application/json\"], \"produces\": [\"application/json\"], \"responses\": {\"200\": {\"description\": \"200 response\", \"schema\": {\"$ref\": \"#/definitions/Empty\"}}}, \"x-amazon-apigateway-integration\": {\"responses\": {\"default\": {\"statusCode\": \"200\"}}, \"uri\": \"${aws_lambda_function.api_handler.invoke_arn}\", \"passthroughBehavior\": \"when_no_match\", \"httpMethod\": \"POST\", \"contentHandling\": \"CONVERT_TO_TEXT\", \"type\": \"aws_proxy\"}}}}, \"definitions\": {\"Empty\": {\"type\": \"object\", \"title\": \"Empty Schema\"}}, \"x-amazon-apigateway-binary-media-types\": [\"application/octet-stream\", \"application/x-tar\", \"application/zip\", \"audio/basic\", \"audio/ogg\", \"audio/mp4\", \"audio/mpeg\", \"audio/wav\", \"audio/webm\", \"image/png\", \"image/jpg\", \"image/jpeg\", \"image/gif\", \"video/ogg\", \"video/mpeg\", \"video/webm\"]}"
      }
    }
  },
  "output": {
    "EndpointURL": {
      "value": "${aws_api_gateway_deployment.rest_api.invoke_url}"
    },
    "RestAPIId": {
      "value": "${aws_api_gateway_rest_api.rest_api.id}"
    },
    "RestAPIStageArn": {
      "value": "aws_api_gateway_stage.rest_api.arn"
    }
  }
}
```

</details>

I also noticed that when I try to deploy an existing Chalice app that was using the previous tf template generation, I see this in the output:

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.rest_api must be replaced
+/- resource "aws_api_gateway_deployment" "rest_api" {
      ~ created_date      = "2021-12-08T20:33:23Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:760296166491:2orvj7maoi/api" -> (known after apply)
      ~ id                = "xsb3aj" -> (known after apply)
      ~ invoke_url        = "https://2orvj7maoi.execute-api.us-west-2.amazonaws.com/api" -> (known after apply)
      - stage_description = "e298b85a463dbbd0fa086cf759dc8f8a" -> null # forces replacement
      - stage_name        = "api" -> null # forces replacement
      + triggers          = {
          + "redeployment" = "sha1(jsonencode(aws_api_gateway_rest_api.rest_api.body))"
        } # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.rest_api will be created
  + resource "aws_api_gateway_stage" "rest_api" {
      + arn           = (known after apply)
      + deployment_id = "aws_api_gateway_deployment.rest_api.id"
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "2orvj7maoi"
      + stage_name    = "api"
      + tags_all      = (known after apply)
    }
```

The deployment fails with:

```
╷
│ Error: Error creating API Gateway Stage: ConflictException: Stage already exists
│
│   with aws_api_gateway_stage.rest_api,
│   on chalice.tf.json line 89, in resource.aws_api_gateway_stage.rest_api:
│   89:       }
│
╵
```

but assuming it was able to deploy successfully, wouldn't this mean that the rest API would be replaced and therefore have a new Rest API url?
